Revit 2027 API
ExportLineweightTable.GetLineweightTableIterator Method
Returns a ExportLineweightTableIterator that iterates through the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLineweightTableIterator GetLineweightTableIterator()
Public Function GetLineweightTableIterator As ExportLineweightTableIterator
public:
ExportLineweightTableIterator^ GetLineweightTableIterator()
member GetLineweightTableIterator : unit -> ExportLineweightTableIterator
Return Value
ExportLineweightTableIterator
A ExportLineweightTableIterator object that can be used to iterate through key-value pairs in the collection.
See Also
Reference
ExportLineweightTable Class
Autodesk.Revit.DB Namespace